#+TITLE: Grade sheet for your assignment

*Warning* Giving you this feedback via github is still experimental. No rights can be derived from this file. The grade provided by the exam office is the official grade. Also this grade is rounded while the file below gives the decimal score.


|                           | grade |
|---------------------------+-------|
| Research question         |   0.5 |
| Motivation                |   0.5 |
| Method and data           |   0.5 |
| Preview of the answers    |   0.5 |
| Main assumptions          |   0.3 |
| Python code               |   2.0 |
| Robustness analysis       |   0.1 |
| Discussion and conclusion |   0.3 |
|---------------------------+-------|
| Total                     |   4.7 |
#+TBLFM: @10$2=vsum(@2$2..@9$2)

* Research question (0.5 points)
- clear RQ

* Motivation (0.5 points)
- clear motivation

* Method and data (1.0 point)
- link to data source provided
- missing justification for substituting missing values by averages, how was threshold for 75% of non-missings chosen?
- clear method overview missing (as well as motivation for choosing those methods)
(-0.5)

* Preview of the answers (0.5 points)
- clear preview

* Main assumptions (0.5 points)
- are there any assumptions related to the methods? (-0.2)

* Python code (6 points)
- OLS: interpretation of results/coefficients missing, what are the "independent variables"?
- missing justification of the model specifications:
     - cell [13]: how are layers chosen? activation functions? loss function? optimizers? and what do these do?
     - cell [14]: how is batch size and number of epochs determined? what does it do? what is early stopping good for? and patience?
     - cell [15]: "as we see above, the RMSE and the MSE are getting smaller with each epoch" -> then why not even increase the number of epochs? (explanation missing)      
     - cell [3]: why and how is the data scaled?
- in general, extremely little explanation (and code)  
- not enough topics from the class covered (no bayesian, no analysis of causality and treatment effects, no data simulation, limited use of pandas) (-2.0)

(-4.0)

* Robustness analysis (0.5 points)
- introduces code for ridge and lasso, but no interpretation or explanation present (-0.4)

* Discussion and conclusion (0.5 points)
- "we can infer with certainty" - this is a very strong statement, would be better to provide some quantifiable statement
(-0.2)  
  

